import React from "react";
import Header from "../../components/header/Header";
import "./about-us.less";

function UserManual() {

  return (
    <div
      className="gray-bg"
      style={{
        display: "flex",
        alignItems: "center",
        flexDirection: "column",
        height: "100vh",
      }}
    >
      <Header
        title="درباره داپ‌اَپ"
        leftIcon="assets/images/arrow-w-rotate.svg"
        back={"main"}
      />
      <div className="about-us-div">
        <p>
          شرکت دانش بنیان درنیکا اندیشه پرهام در تیرماه سال 1398 تأسیس شده و
          برای نخستین بار در ایران، پلتفرم پاداش نقدی خرید (Cashback Reward
          Platform) با نام تجاری <strong>"داپ‌اَپ"</strong> را با مشارکت نظام بانکی کشور طراحی و
          راه‏اندازی کرده است. سرلوحة تمامی اهداف و اقدامات این شرکت، <strong>"ایجاد
          رونق در تولید، تجارت و اقتصاد کشور از طریق افزایش قدرت خرید مردم"</strong> است.
        </p>
        <p>
          در این پلتفرم، عموم مردم می‏توانند با ثبت یک یا چند کارت بانکی عضو
          شبکه شتاب در اپلیکیشن داپ‌اَپ، و خرید از اصناف طرف قرارداد و انجام
          تراکنش در کارتخوان‏های عضو طرح، هر روز تا <strong>۱۴ درصد</strong> از کل مبلغ خرید خود
          را بعنوان پاداش خرید، بصورت نقدی دریافت کنند. صاحبان کسب‏وکار و اصناف
          نیز علاوه بر اینکه به واسطه معرفی در اپلیکیشن داپ‌اَپ، رونق گرفته و
          مورد استقبال مشتریان قرار می‏گیرند، در ازای کسب امتیاز لازم می‌توانند
          از سایر مزایای متنوع و جذاب این طرح نیز بهره‏مند شوند.
        </p>
        <p>مدل کسب و کار خلاقانه پلتفرم "داپ‌اَپ" تضمین می‏کند که مشتریان به سادگی و بدون تشریفات دست و پا گیر، تنها با کشیدن کارت در دستگاه‏های کارتخوان <strong>"به ‏پرداخت ملت"</strong> ، <strong>"تاپ"</strong> (تجارت الکترونیک پارسیان) ،<strong>"سپ"</strong> (پرداخت الکترونیک سامان کیش) از مزایای طرح بهره‏مند شوند. داپ‌اَپ بدون محدودیت، در تمامی اصناف و فروشگاه‏ها و برای خرید همۀ کالاها و خدمات قابل استفاده است، با تمامی کارت‏های بانکی عضو شتاب سازگار است و پاداش نقدی آن بدون قید و شرط و در عرض 24 ساعت به حساب مشتریان واریز می‏شود. این مزیت کلیدی، داپ‌اَپ را بعنوان یک پلتفرم متمایز و متفاوت در عرصۀ فناوری‏های مالی (فینتک) مطرح کرده است. </p>
      </div>
    </div>
  );
}

export default UserManual;
